# bot/data/wheel_catalog.py
# Примерный мини-каталог допустимых сочетаний. Позже можно подменить на БД/склад.
CATALOG = [
    # VAG
    {"r": 16, "j": 6.5, "pcd": "5x112", "et": 45, "dia": "57.1"},
    {"r": 17, "j": 7.0, "pcd": "5x112", "et": 45, "dia": "57.1"},
    {"r": 17, "j": 7.5, "pcd": "5x112", "et": 40, "dia": "57.1"},
    {"r": 18, "j": 8.0, "pcd": "5x112", "et": 35, "dia": "66.6"},
    {"r": 18, "j": 8.0, "pcd": "5x112", "et": 45, "dia": "66.6"},

    # Toyota
    {"r": 16, "j": 6.5, "pcd": "5x114.3", "et": 45, "dia": "60.1"},
    {"r": 17, "j": 7.0, "pcd": "5x114.3", "et": 45, "dia": "60.1"},
    {"r": 18, "j": 7.5, "pcd": "5x114.3", "et": 40, "dia": "60.1"},

    # BMW
    {"r": 17, "j": 7.5, "pcd": "5x120", "et": 34, "dia": "72.6"},
    {"r": 18, "j": 8.0, "pcd": "5x120", "et": 34, "dia": "72.6"},
    {"r": 19, "j": 8.5, "pcd": "5x120", "et": 30, "dia": "72.6"},

    # универсальные варианты
    {"r": 16, "j": 6.0, "pcd": "4x100", "et": 38, "dia": "56.1"},
    {"r": 17, "j": 7.0, "pcd": "5x100", "et": 38, "dia": "56.1"},
]
